// pages/reading/reading.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    node:''
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    const that = this;
    let data = `
    <div style="font-size: 16px; line-height: 34px;">
			<h3 style="">第1章 楔子</h3>
			<div>
				<p>“贱人去死！”</p>
				<p>容姒只来得及听见这样一句恶狠狠的话，耳边便瞬间响起一阵刺耳难听的刹车声，随后剧痛袭遍全身，浑身的骨头就像是散了架似的，连睁眼都费力的很。
意识再次回笼的时候，她发觉自己整个轻飘得有些吓人，赶忙转头看过去那推自己出来的贱人是谁的的时候，却只看见了一个急忙逃窜的背影。
纠缠、诋毁了自己近一个月的人就是化成灰她都能认得出来，更别说一个背影</p>
				<p>以半透明状态漂浮在半空之中的容姒，看着那急忙逃窜的女人，只觉得恨得自己牙根发痒。</p>
				<p>怎么这么大的世界就让自己遇到了这么个神经病？</p>
				<p>偌大的魔都，容姒在母亲的庇荫下，也算是有房有车一族，再加上又找了份好工作，小日子可以算是过得相当的滋润。</p>
				<p>今年刚过三十大关，未婚，但喜欢谈恋爱，可惜按照她那么个喜新厌旧的性子，几乎每一场恋爱都维持在一两个月的时间内。</p>
			</div>
			<h3>第2章 替身替身（一）</h3>
			<div>
				<p>“你以为你是谁？你凭什么跟她比？不过就是我找来打发时间的一个替身罢了，还真以为是在跟我在谈恋爱了？呵，也不看看你配不配？”
　　哎？替身？这人在说个什么东西？不对，这人谁呀？</p>
				<p>系统提示：发现渣渣江承亦，系统评分98，可视为重点攻略对象，是否开启好感度查询？</p>
				<p>刚刚回过神来的容姒听到以上这么两段话的表情是懵逼的，眼睛刚瞪大，原身蓄积了许久的眼泪竟然直接就从眼眶之中落了下来，重重地砸到了面前之人的手背上。
　　我，哭了？
				</p>
				<p>她下意识地低头，要知道她长这么大哭的机会屈指可数，连她亲妈走的时候都没哭，现在面对这么个陌生男人哭个什么劲儿？不过这男人倒是挺帅的，对她的胃口。额，不对，系统是什么东西？
　　那人却被这滚烫的眼泪一砸，掐住她下巴的手指不由自主地便哆嗦了下，见对方低着头一副伤心到难以自抑的模样，皱了皱眉，心中不免就产生了一丝歉疚，可又觉得自己刚刚说的话并没有任何问题，本来她就知道自己找来的一个替身罢了，怎么可以和以柔相提并论，那根本就是对以柔的侮辱！
　　这么想着，男人便撤下了自己的手，居高临下地看着容姒，刚准备开口说些什么的时候。</p>
				<p>来电铃声突然响起，他疑惑地从口袋里掏出手机，接通，只听了一瞬，便瞳孔放大，突然大吼了一声，“好！好！你在那里等我，我马上就出来找你，等我！一定要等我！”
　　这么多年了，他终于有以柔的消息了，这一回他一定要赶在他哥面前找到她才是，一定要！</p>
				<p>他紧紧捏着手机，整个人激动得都有些难以自已了，甚至都未来得及再看容姒一眼，一把捞起自己放在一旁的外套，飞一般地冲了出去。
　　沉浸在自己心思中的容姒直接就被这砰的一声关门声吓了一跳，再抬起头，整个屋子都已经成了空荡荡的一片了。
　　哎，人呢？刚刚这不该有个男人才对吗？一个长得很符合她审美的男人啊？人呢？
　　容姒一脸惊诧。</p>
				<p>这么想完她又低头看了看自己的手掌心，几乎可以百分之百的肯定，这双手绝对不是自己的，她的没有那么粗糙，那么她这算是穿越了？
　　也就在这时，她突然想起她之前听到的那一阵机械音来……</p>
			</div>
			<h3>第3章 替身替身（二）</h3>
			<div>
				<p>这是容姒接收完所有剧情之后的唯一反应。</p>
  　　	<p>“这个叫容姒的和我有关系吗？”然后她朝系统问出了她的第一句话。</p>
  　　	<p>闻言，系统还沉默了好一会，良久才回道，“仅仅同名罢了……”</p>
			  <p>听到这么一句话，容姒这才彻底地舒了口气，这还差不多，想她容姒也算是纵横情场十几年了，到现在都还未遇到一个敌手，哪一次不是她渣别人，什么时候轮到别人来渣她了？知道这个容姒不是自己的前世，也不是平行世界的另一个自己，仅仅只是同名，她的心里一下就舒坦了不少。
　　不过就是同名，她还是隐隐觉得有些呕得慌，因为这姑娘根本就是脑子有坑啊，还是被陨石砸出的坑，那种渣男到底哪里好了？啊？</p>
				<p>都对你那样了，最后瘸了毁容了你不放两串鞭炮庆祝下，还眼巴巴地回去照顾他？最后还大团圆结局了？</p>
				<p>这女的根本就是智障吧？</p>
				<p>我要是她出车祸的父母知道了恐怕会直接就从棺材里跳出来，将她一起带下去，省得看着闹心。</p>
				<p>话说就是到了结局都是女主吃亏啊，男主还是瘸的，毁容的，是为了衬托女主爱得坚贞，爱得伟大，还是因为这样两人才正好相配？</p>
				<p>反正不管哪一种原因，容姒都觉得堵得心慌……</p>
				<p>“所以我要做的就是攻略这人的心是吗？”平复了一会，容姒才在脑海中这么问向系统。</p>
				<p>“是。”</p>
				<p>“攻略之后呢？”</p>
				<p>“……随你。”</p>
				<p>咦？”</p>
			　<p>容姒舔了舔下唇，这其中大有可为啊！</p>
			　<p>“刚刚的好感度是怎么回事？”</p>
			　<p>“是否开启江承亦好感度查询？”</p>
			　<p>“是。”</p>
				<p>“现处于新手任务中，此次收费可免，开启江承亦好感度查询与提示。”</p>
				<p>“等等，我刚刚就想问你了，你每次都说此次收费可免，是不是以后的任务你还会收钱啊？我去，我帮你工作，你还要收我钱，你不要太过分了，417,417，我看你这根本就是死要钱的谐音吧，你一个系统要那么多钱做什么？丑话说在前头，我没钱！穷鬼一个！”</p>
			</div>
		</div>
    `;
    that.setData({ node: data })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})